In [2]:
import pandas as pd

In [141]:
a = pd.Series([1,2,3,4,5])
p = pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])

In [142]:
a

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [143]:
p

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [144]:
type(a)

pandas.core.series.Series

In [146]:
print(a[2])
print(p['d'])

3
4

In [138]:
#Numpy
import numpy as np
b = np.array([10,11,12,13,14,15])
b < 13

array([ True,  True,  True, False, False, False])

In [155]:
b.mean()

12.5

In [147]:

a>3

0    False
1    False
2    False
3     True
4     True
dtype: bool

In [149]:
#DataFrame or DataSeries
a[a>3]

3    4
4    5
dtype: int64

In [150]:
a

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [152]:
#List
import pandas as pd
data = [['Alex',10],['Bob',12],['Clarke',13]]
#df = pd.DataFrame(data)
df = pd.DataFrame(data,columns=['Name','Age'])
print (df)

     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13

In [160]:
#Dict
import pandas as pd
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42],'Education':['10','Btech','12','PostGrad']}
df = pd.DataFrame(data)
print (df)

   Age Education   Name
0   28        10    Tom
1   34     Btech   Jack
2   29        12  Steve
3   42  PostGrad  Ricky

In [171]:
df['Age'].std()

6.3966136874651625

In [172]:
#Panda Series
import pandas as pd

d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
      'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
print (df)

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [185]:
#Creating a new column
raw_data = {'name': ['Willard Morris', 'Al Jennings', 'Omar Mullins', 'Spencer McDaniel'],
                      'age': [20, 19, 22, 21],
                      'favorite_color': ['blue',np.nan , 'yellow', "green"],
                      'test_one': [88, 92, 95, 70],
                      'test_two': [78, 100, 90, 85]}
df = pd.DataFrame(raw_data)
df

   age favorite_color              name  test_one  test_two
0   20           blue    Willard Morris        88        78
1   19            NaN       Al Jennings        92       100
2   22         yellow      Omar Mullins        95        90
3   21          green  Spencer McDaniel        70        85

In [174]:
df['test_average'] = (df.test_one + df.test_two)/2
df.head()

   age favorite_color              name  test_one  test_two  test_average
0   20           blue    Willard Morris        88        78          83.0
1   19            NaN       Al Jennings        92       100          96.0
2   22         yellow      Omar Mullins        95        90          92.5
3   21          green  Spencer McDaniel        70        85          77.5

In [177]:
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 6 columns):
age               4 non-null int64
favorite_color    3 non-null object
name              4 non-null object
test_one          4 non-null int64
test_two          4 non-null int64
test_average      4 non-null float64
dtypes: float64(1), int64(3), object(2)
memory usage: 272.0+ bytes

             age   test_one    test_two  test_average
count   4.000000   4.000000    4.000000      4.000000
mean   20.500000  86.250000   88.250000     87.250000
std     1.290994  11.206397    9.251126      8.509798
min    19.000000  70.000000   78.000000     77.500000
25%    19.750000  83.500000   83.250000     81.625000
50%    20.500000  90.000000   87.500000     87.750000
75%    21.250000  92.750000   92.500000     93.375000
max    22.000000  95.000000  100.000000     96.000000

In [181]:
#drop column
df.drop(['age'], axis = 1, inplace = True)
df

  favorite_color              name  test_one  test_two  test_average
0           blue    Willard Morris        88        78          83.0
1            NaN       Al Jennings        92       100          96.0
2         yellow      Omar Mullins        95        90          92.5
3          green  Spencer McDaniel        70        85          77.5

In [186]:
df.drop(1, inplace = True)
df

   age favorite_color              name  test_one  test_two
0   20           blue    Willard Morris        88        78
2   22         yellow      Omar Mullins        95        90
3   21          green  Spencer McDaniel        70        85

In [190]:
df[df['favorite_color'] == 'blue'].index

Int64Index([0], dtype='int64')

In [191]:
df.drop(df[df['favorite_color'] == 'blue'].index)

   age favorite_color              name  test_one  test_two
2   22         yellow      Omar Mullins        95        90
3   21          green  Spencer McDaniel        70        85

In [ ]:
df

In [ ]:
df[0:5:2]

In [ ]:
df[df['favorite_color'].notnull()]
#df['test_two'] > 10

In [ ]:
df[df['favorite_color'].isnull()]

In [11]:
import pandas as pd
cereal_df = pd.read_csv("bank.csv")

In [12]:
cereal_df.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,deposit
0,59,admin.,married,secondary,no,2343,yes,no,unknown,5,may,1042,1,-1,0,unknown,yes
1,56,admin.,married,secondary,no,45,no,no,unknown,5,may,1467,1,-1,0,unknown,yes
2,41,technician,married,secondary,no,1270,yes,no,unknown,5,may,1389,1,-1,0,unknown,yes
3,55,services,married,secondary,no,2476,yes,no,unknown,5,may,579,1,-1,0,unknown,yes
4,54,admin.,married,tertiary,no,184,no,no,unknown,5,may,673,2,-1,0,unknown,yes

In [13]:
df = pd.DataFrame({'age':[30, 2, 12, 4, 32, 33, 69],
                   'color':['blue', 'green', 'red', 'white', 'gray', 'black', 'red'],
                   'food':['Steak', 'Lamb', 'Mango', 'Apple', 'Cheese', 'Melon', 'Beans'],
                   'height':[165, 70, 120, 80, 180, 172, 150],
                   'score':[4.6, 8.3, 9.0, 3.3, 1.8, 9.5, 2.2],
                   'state':['NY', 'TX', 'FL', 'AL', 'AK', 'TX', 'TX']
                   },
                  index=['Jane', 'Nick', 'Aaron', 'Penelope', 'Dean', 'Christina', 'Cornelia'])

In [14]:
df

           age  color    food  height  score state
Jane        30   blue   Steak     165    4.6    NY
Nick         2  green    Lamb      70    8.3    TX
Aaron       12    red   Mango     120    9.0    FL
Penelope     4  white   Apple      80    3.3    AL
Dean        32   gray  Cheese     180    1.8    AK
Christina   33  black   Melon     172    9.5    TX
Cornelia    69    red   Beans     150    2.2    TX

In [17]:
#loc with index
df.loc['Penelope']
#df.iloc[3]

age           4
color     white
food      Apple
height       80
score       3.3
state        AL
Name: Penelope, dtype: object

In [18]:
df.loc[['Cornelia', 'Jane', 'Dean']]

          age color    food  height  score state
Cornelia   69   red   Beans     150    2.2    TX
Jane       30  blue   Steak     165    4.6    NY
Dean       32  gray  Cheese     180    1.8    AK

In [7]:
df.loc['Aaron':'Dean']

          age  color    food  height  score state
Aaron      12    red   Mango     120    9.0    FL
Penelope    4  white   Apple      80    3.3    AL
Dean       32   gray  Cheese     180    1.8    AK

In [8]:
#similar to list 
df.iloc[4]

age           32
color       gray
food      Cheese
height       180
score        1.8
state         AK
Name: Dean, dtype: object

In [10]:
#similar to list 
df.iloc[4:6]

           age  color    food  height  score state
Dean        32   gray  Cheese     180    1.8    AK
Christina   33  black   Melon     172    9.5    TX